adhoc-executable-patching-on-nix.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-18 Wed 16:53 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0" />
<title>adhoc executable patching on nixos</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="adhoc executable patching on nixos">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/newfeather.png">
<meta property="og:url" content="https://notes.neeasade.net/adhoc-executable-patching-on-nix.html">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='/assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='./assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='/assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='./assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=444396e7a7768e08c9594d95c6234b4a'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=444396e7a7768e08c9594d95c6234b4a'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>../ＳＴＸ</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2020-03-14-adhoc-executable-patching-on-nix.org">source</a>
</div>
<h1 class=title>adhoc executable patching on nixos</h1>
<div class="org-center">
<p>

</p>
</div>
<div class=pubinfo
Published 2020-03-14, last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2020-03-14-adhoc-executable-patching-on-nix.org">2021-01-03</a>
</div>
<hr>
<p>
&rsquo;one weird trick&rsquo; for getting that ELF executable someone just handed you working soon™
</p>

<p>
Create a <code>shell.nix</code> file that looks like:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #5a5a5a;">let</span>
  <span style="color: #0095ac;">pkgs</span> = <span style="color: #5a5a5a;">import</span> <span style="color: #5a5a5a;">&lt;nixpkgs&gt;</span> {};
<span style="color: #5a5a5a;">in</span> pkgs.mkShell {
  <span style="color: #0095ac;">nativeBuildInputs</span> =
    (<span style="color: #5a5a5a;">with</span> pkgs; [
      gcc

      <span style="color: #8a8a8a;"># example libraries you might want:</span>
      zlib
      SDL2
    ]);
}
</pre>
</div>

<p>
Launch the nix-shell, patch the linker so you can call the executable and see what&rsquo;s up:
</p>

<div class="org-src-container">
<pre class="src src-sh">; nix-shell shell.nix
; patchelf --set-interpreter <span style="color: #cb7000;">"$(</span><span style="color: #0095ac;">cat $NIX_CC/nix-support/dynamic-linker</span><span style="color: #cb7000;">)"</span> /path/to/executable
</pre>
</div>

<p>
Strategies to find out what you might need:
</p>

<div class="org-src-container">
<pre class="src src-sh">; ldd /path/to/executable
; strace /path/to/executable
</pre>
</div>

<p>
Update the <code>shell.nix</code> file with the dependencies/linked libraries your executable might need, and then patch the executable from the derived nix-shell based on that:
</p>

<div class="org-src-container">
<pre class="src src-sh">; nix-shell ./shell.nix
; <span style="color: #8a8a8a;"># </span><span style="color: #8a8a8a;">you may want to peek at new_rpath here or mangle NIX_LDFLAGS yourself</span>
; <span style="color: #0095ac;">new_rpath</span>=$(<span style="color: #0095ac;">echo "$NIX_LDFLAGS" | tr ' ' $'\n' | grep "^-L" | sed -E 's/^-L/:/' | tr -d $'\n'</span>)
; patchelf --set-rpath <span style="color: #cb7000;">"$new_rpath"</span> /path/to/executable
</pre>
</div>

<p>
Then you should be able to run the executable by calling it normally (in or out of a nix-shell context).
</p>

<p>
<div class=separator>∗ ∗ ∗</div>
</p>

<p>
That&rsquo;s all well and good for <i>right now</i>, but what if we lose the nix store references we just patched in! Plus, we can&rsquo;t exactly carry this around. Let&rsquo;s note how to do the above as a build definition (the example here is a dynamically-linked release of  <a href="https://github.com/borkdude/babashka/releases/tag/v0.1.3">babashka</a>):
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #0095ac;">babashka</span> = stdenv.mkDerivation <span style="color: #5a5a5a;">rec</span> {
    <span style="color: #0095ac;">name</span> = <span style="color: #cb7000;">"babashka"</span>;
    <span style="color: #8a8a8a;"># this is the way to coerce a string into a path</span>
    <span style="color: #8a8a8a;"># src = /. + "/home/neeasade/temps/2020-04-20_07:21:05/bb";</span>

    <span style="color: #8a8a8a;"># showing a few different ways:</span>
    <span style="color: #8a8a8a;"># src = /. + "/home/neeasade/temps/2020-04-20_07:21:05/babashka-0.0.88-linux-amd64.zip";</span>
    <span style="color: #0095ac;">src</span> = (fetchurl {
        <span style="color: #0095ac;">url</span> = <span style="color: #cb7000;">"https://github.com/borkdude/babashka/releases/download/v0.1.3/babashka-0.1.3-linux-amd64.zip"</span>;
        <span style="color: #0095ac;">sha256</span> = <span style="color: #cb7000;">"0nldq063a1sfk0qnkd37dpw8jq43p4divn4j4qiif6dy1qz9xdcq"</span>;
    });

    <span style="color: #0095ac;">unpackPhase</span> = <span style="color: #cb7000;">"unzip $src"</span>;
    <span style="color: #8a8a8a;"># if src is a path to the executable:</span>
    <span style="color: #8a8a8a;"># unpackPhase = "cp $src bb";</span>

    <span style="color: #8a8a8a;"># note: the chmod is only needed when using direct path to local executable</span>
    <span style="color: #0095ac;">patchPhase</span> = <span style="color: #cb7000;">''</span>
<span style="color: #cb7000;">        chmod u+w ./bb</span>
<span style="color: #cb7000;">        patchelf --set-interpreter "$(cat $NIX_CC/nix-support/dynamic-linker)" ./bb</span>
<span style="color: #cb7000;">        new_rpath=$(echo "$NIX_LDFLAGS" | tr ' ' $'\n' | grep "^-L" | sed -E 's/^-L/:/' | tr -d $'\n')</span>
<span style="color: #cb7000;">        patchelf --set-rpath "$new_rpath" ./bb</span>
<span style="color: #cb7000;">    ''</span>;

    <span style="color: #0095ac;">dontBuild</span> = <span style="color: #5a5a5a;">true</span>;

    <span style="color: #0095ac;">installPhase</span> = <span style="color: #cb7000;">''</span>
<span style="color: #cb7000;">        mkdir -p $out/bin</span>
<span style="color: #cb7000;">        cp bb $out/bin</span>
<span style="color: #cb7000;">    ''</span>;

    <span style="color: #0095ac;">nativeBuildInputs</span> = (<span style="color: #5a5a5a;">with</span> pkgs; [
        gcc-unwrapped.lib zlib unzip
    ]);
};
</pre>
</div>

<p>
And bam! now we can integrate our sins into our package definitions.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-08-07&gt;</span></span> There is also the very cool looking <a href="https://github.com/svanderburg/nix-patchtools">autopatchelf</a>, which appears to try and do our first attempt automatically.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-11-25&gt;</span></span> Another solution has come up: <a href="https://fzakaria.com/2020/11/17/on-demand-linked-libraries-for-nix.html">on demand linked libraries for nix</a>
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-01-01&gt;</span></span> This popped up on my feed today and is also a cool solution to this problem: <a href="https://github.com/Lassulus/nix-autobahn">nix-autobahn</a>
</p>

<div class="footer-center">
    
</div>
</div>
</body>
</html>
